//
//#include <stdio.h>
//#include <stdlib.h>
//int main()
//{
//    int i, j, s = 0;
//
//    for (i = 1; i <= 9; i++)
//    {
//        s = 0;
//        for (j = 1; j <= i; j++)
//        {
//            printf("%d*%d=%-4d", j, i, j * i);
//            s++;
//        }
//        printf("\n");
//    }
//    getchar();
//    return 0;
//}//在输出格式控制字符串中：按十进制输出对应的变量值，格式为4列左对齐；
//   //                      实际数位不足4列时后面用空格补齐，
//    //                     实际数位多于4位时按实际数位输出。................................%-4d
